# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были
# повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть

import random

coins = int(input("Введите количество монет на столе: "))
a = 0
v = random.randint(1, 10)

for i in range(coins):
    if v == 1:
        a += 1
if coins > v:
    a = coins - v
    print(f"Решкой вверх лежат {a} монеты")
else:
    print("Введены не верные данные! Повторите попытку...")
if a < coins // 2:
    print(f"{a} монет нужно перевернуть ")
else:
    print(f"{v} колличество монет нужно перевернуть.")
